<?php
use \Asdrubael\Utils;
include "buildTree.php";
$JSON = "[
{
\"UID\": \"73dbd455-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"\",
\"Наименование\": \"Волосы\"
},
{
\"UID\": \"97bcfe5a-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"\",
\"Наименование\": \"Лицо\"
},
{
\"UID\": \"73dbd47b-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"\",
\"Наименование\": \"Макияж\"
},
{
\"UID\": \"73dbd4f0-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"\",
\"Наименование\": \"Мужская категория\"
},
{
\"UID\": \"bb97bd4b-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"\",
\"Наименование\": \"Парфюмерная продукция\"
},
{
\"UID\": \"8bc5d4c2-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"\",
\"Наименование\": \"Подарки\"
},
{
\"UID\": \"79da3767-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"\",
\"Наименование\": \"Прочий ассортимент\"
},
{
\"UID\": \"73dbd49e-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"\",
\"Наименование\": \"Тело\"
},
{
\"UID\": \"73dbd456-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd455-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Аксессуары (волосы)\"
},
{
\"UID\": \"85ccc30b-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd455-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Окрашивание\"
},
{
\"UID\": \"79da371f-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd455-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства для моделирования\"
},
{
\"UID\": \"7fd41290-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd455-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства по уходу за волосами\"
},
{
\"UID\": \"73dbd457-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd456-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Аксессуары для волос\"
},
{
\"UID\": \"4bb1024b-4661-11e9-a243-00505601048d\",
\"Родитель\": \"73dbd457-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Аксессуары для окрашивания\"
},
{
\"UID\": \"eb7b39f0-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd457-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Заколки, резинки\"
},
{
\"UID\": \"73dbd4cf-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd457-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Прочие аксессуары для волос\"
},
{
\"UID\": \"73dbd458-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd457-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Расчески\"
},
{
\"UID\": \"73dbd494-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd47b-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Аксессуары (макияж)\"
},
{
\"UID\": \"9db5c640-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd47b-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Декоративная косметика\"
},
{
\"UID\": \"73dbd47c-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd47b-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства для ногтей\"
},
{
\"UID\": \"d98a02bb-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd47c-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Дизайн ногтей\"
},
{
\"UID\": \"a3ad3e86-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd47c-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Покрытия\"
},
{
\"UID\": \"d98a02e7-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd47c-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства для снятия лака\"
},
{
\"UID\": \"73dbd47d-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd47c-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Уход за ногтями\"
},
{
\"UID\": \"73dbd47e-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd47d-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Инструменты для маникюра и педикюра\"
},
{
\"UID\": \"73dbd485-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd47d-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Пилочки для ногтей\"
},
{
\"UID\": \"571ef44a-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd47d-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Прочие средства по уходу за ногтями\"
},
{
\"UID\": \"a3ad3f00-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd47d-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства для сушки лака для ногтей\"
},
{
\"UID\": \"d98a02b2-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd47d-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства по уходу за ногтями\"
},
{
\"UID\": \"73dbd495-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd494-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Аксессуары для макияжа\"
},
{
\"UID\": \"b59f422d-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd495-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Аппликаторы для макияжа\"
},
{
\"UID\": \"73dbd4e2-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd495-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Кисти для макияжа\"
},
{
\"UID\": \"b59f41fc-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd495-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Косметички\"
},
{
\"UID\": \"58529a4c-aaac-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd495-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Наборы кистей\"
},
{
\"UID\": \"d38a5542-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd495-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Накладные ресницы\"
},
{
\"UID\": \"73dbd496-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd495-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Пинцеты\"
},
{
\"UID\": \"73dbd4da-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd495-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Прочие аксессуары для макияжа\"
},
{
\"UID\": \"73dbd4e4-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd495-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Спонжи для макияжа\"
},
{
\"UID\": \"0df9dd91-dfa9-11e8-a22f-00505601048d\",
\"Родитель\": \"73dbd495-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Сумка для косметики.\"
},
{
\"UID\": \"ac8664c2-ef15-11e8-a230-00505601048d\",
\"Родитель\": \"73dbd495-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Шкатулки\"
},
{
\"UID\": \"27bb4c5a-4662-11e9-a243-00505601048d\",
\"Родитель\": \"73dbd49e-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Аксессуары для ухода за телом\"
},
{
\"UID\": \"7fd4121a-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd49e-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Дезодоранты\"
},
{
\"UID\": \"79da36e7-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd49e-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Депиляция\"
},
{
\"UID\": \"d98a02d3-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd49e-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Загар\"
},
{
\"UID\": \"7fd4123b-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd49e-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства гигиены\"
},
{
\"UID\": \"73dbd49f-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd49e-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства для ног\"
},
{
\"UID\": \"97bcfe86-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd49e-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства для рук\"
},
{
\"UID\": \"73dbd4a9-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd49e-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства для ухода за телом\"
},
{
\"UID\": \"c2c37464-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd49e-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Туалетная бумага\"
},
{
\"UID\": \"73dbd4a0-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd49f-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Уход за ногами\"
},
{
\"UID\": \"c791f534-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd4a0-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Дезодоранты для ног\"
},
{
\"UID\": \"97bcfe83-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd4a0-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Кремы для ног\"
},
{
\"UID\": \"f770b332-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd4a0-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Маска для ног\"
},
{
\"UID\": \"00c6ca2c-1e46-11e9-a23c-00505601048d\",
\"Родитель\": \"73dbd4a0-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Носки для педикюра\"
},
{
\"UID\": \"f770b358-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd4a0-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Патчи для ног\"
},
{
\"UID\": \"73dbd4a1-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd4a0-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Прочие товары для ног\"
},
{
\"UID\": \"97bcfe81-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd4a0-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Скраб, пилинг для ног\"
},
{
\"UID\": \"8cf11ab1-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd4a9-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Масла\"
},
{
\"UID\": \"97bcfe76-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd4a9-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Моделирующие средства\"
},
{
\"UID\": \"c1974ca3-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd4a9-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства для бани\"
},
{
\"UID\": \"73dbd4aa-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd4a9-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства для ванны\"
},
{
\"UID\": \"73dbd4e9-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd4a9-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства для очищения тела\"
},
{
\"UID\": \"97bcfebb-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd4a9-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства для увлажнения тела\"
},
{
\"UID\": \"fd6dbaff-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd4aa-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Бомбочки\"
},
{
\"UID\": \"97bcfec7-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd4aa-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Пены для ванны\"
},
{
\"UID\": \"d98a0298-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd4aa-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Соли\"
},
{
\"UID\": \"7fd41218-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd4e9-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Гель, крем для душа\"
},
{
\"UID\": \"7fd4121f-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd4e9-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Мыло жидкое\"
},
{
\"UID\": \"73dbd4ea-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd4e9-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Мыло кусковое\"
},
{
\"UID\": \"45316918-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd4e9-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Прочие средства для очищения тела\"
},
{
\"UID\": \"9db5c63b-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd4e9-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Скрабы, пилинги для тела\"
},
{
\"UID\": \"79da374c-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd4f0-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Дезодоранты (муж)\"
},
{
\"UID\": \"73dbd4f1-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd4f0-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Депиляция (муж)\"
},
{
\"UID\": \"f770b335-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd4f0-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Одежда (муж)\"
},
{
\"UID\": \"bb97bd44-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd4f0-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Парфюмерия (муж)\"
},
{
\"UID\": \"3ad72143-d27e-11e8-a227-00505601048d\",
\"Родитель\": \"73dbd4f0-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства для моделирования волос (муж)\"
},
{
\"UID\": \"79da3752-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd4f0-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства для ухода за телом (муж)\"
},
{
\"UID\": \"8bc5d4ff-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd4f0-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства по уходу за волосами (муж)\"
},
{
\"UID\": \"8bc5d4fc-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd4f0-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства по уходу за лицом (муж)\"
},
{
\"UID\": \"73dbd501-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd4f1-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Механические средства для бритья (муж)\"
},
{
\"UID\": \"73dbd4f2-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd4f1-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства для бритья (муж)\"
},
{
\"UID\": \"8bc5d4dd-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd4f1-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства для ухода за бородой\"
},
{
\"UID\": \"79da36d5-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd4f1-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства после бритья (муж)\"
},
{
\"UID\": \"73dbd4f3-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd4f2-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Гели, кремы для бритья (муж)\"
},
{
\"UID\": \"79da36ca-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd4f2-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Пены для бритья (муж)\"
},
{
\"UID\": \"8bc5d4fa-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd4f2-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Прочие средства для бритья (муж)\"
},
{
\"UID\": \"73dbd502-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd501-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Кассеты (м)\"
},
{
\"UID\": \"79da36ed-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd501-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Многоразовые станки (м)\"
},
{
\"UID\": \"79da36e5-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd501-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Одноразовые станки (м)\"
},
{
\"UID\": \"1467a36d-1e43-11e9-a23c-00505601048d\",
\"Родитель\": \"73dbd501-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Прочие механические средства для бритья (м)\"
},
{
\"UID\": \"79da36eb-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"73dbd501-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Системы для бритья (м)\"
},
{
\"UID\": \"79da36dc-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"79da36d5-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Гели, кремы после бритья\"
},
{
\"UID\": \"79da36d6-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"79da36d5-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Лосьоны после бритья\"
},
{
\"UID\": \"703aaec6-aaac-11e8-a216-00505601048d\",
\"Родитель\": \"79da36d5-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Прочие средства после бритья\"
},
{
\"UID\": \"79da36e8-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"79da36e7-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Механические средства для бритья\"
},
{
\"UID\": \"d4b6742d-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"79da36e7-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства для бритья\"
},
{
\"UID\": \"571ef474-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"79da36e7-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства для депиляции\"
},
{
\"UID\": \"9db5c638-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"79da36e7-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства после бритья\"
},
{
\"UID\": \"aad8b11f-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"79da36e7-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства после депиляции\"
},
{
\"UID\": \"79da3712-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"79da36e8-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Кассеты женские\"
},
{
\"UID\": \"79da36ef-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"79da36e8-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Многоразовые станки женские\"
},
{
\"UID\": \"79da36e9-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"79da36e8-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Одноразовые станки женские\"
},
{
\"UID\": \"ee370fa8-fdef-11e8-a231-00505601048d\",
\"Родитель\": \"79da36e8-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Прочие механические средства для бритья\"
},
{
\"UID\": \"79da3749-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"79da36e8-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Системы для бритья женские\"
},
{
\"UID\": \"79da3720-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"79da371f-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Стайлинг\"
},
{
\"UID\": \"cd8fabd5-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"79da3720-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Гель, воск для укладки\"
},
{
\"UID\": \"79da3721-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"79da3720-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Лак для укладки\"
},
{
\"UID\": \"79da3725-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"79da3720-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Пенки, муссы для моделирования\"
},
{
\"UID\": \"828e29cd-fdd9-11e8-a231-00505601048d\",
\"Родитель\": \"79da3720-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Прочий стайлинг\"
},
{
\"UID\": \"79da3740-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"79da3720-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Спрей для укладки\"
},
{
\"UID\": \"c791f5cc-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"79da3720-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Сухие шампуни\"
},
{
\"UID\": \"cd8fabe2-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"79da3720-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Текстурирующая пудра, паста\"
},
{
\"UID\": \"8bc5d4c0-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"79da374c-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Дезодоранты кремовые (муж)\"
},
{
\"UID\": \"79da374d-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"79da374c-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Дезодоранты спреи (муж)\"
},
{
\"UID\": \"79da375b-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"79da374c-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Дезодоранты стики (муж)\"
},
{
\"UID\": \"79da3758-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"79da374c-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Дезодоранты шариковые (муж)\"
},
{
\"UID\": \"cfb3b748-d281-11e8-a227-00505601048d\",
\"Родитель\": \"79da374c-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Прочие дезодоранты (муж)\"
},
{
\"UID\": \"99b3fd22-fdde-11e8-a231-00505601048d\",
\"Родитель\": \"79da374d-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Дезодоранты спреи (м)\"
},
{
\"UID\": \"79da3753-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"79da3752-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства для ухода за телом (м)\"
},
{
\"UID\": \"bac46cd7-4976-11e9-a243-00505601048d\",
\"Родитель\": \"79da3753-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Подарочные наборы для ухода за телом мужские\"
},
{
\"UID\": \"0a5c683e-dfa3-11e8-a22f-00505601048d\",
\"Родитель\": \"79da3753-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства для ухода за телом мужские\"
},
{
\"UID\": \"d9272fae-fdde-11e8-a231-00505601048d\",
\"Родитель\": \"79da3758-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Дезодоранты шариковые (м)\"
},
{
\"UID\": \"cfac1ce5-fdde-11e8-a231-00505601048d\",
\"Родитель\": \"79da375b-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Дезодоранты стики (м)\"
},
{
\"UID\": \"e9cd681c-46e8-11e9-a243-00505601048d\",
\"Родитель\": \"79da3767-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Аксессуары\"
},
{
\"UID\": \"97fface7-4661-11e9-a243-00505601048d\",
\"Родитель\": \"79da3767-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Бижутерия\"
},
{
\"UID\": \"85ccc376-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"79da3767-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Бытовая химия\"
},
{
\"UID\": \"79da3768-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"79da3767-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Гигиена\"
},
{
\"UID\": \"03686057-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"79da3767-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Одежда\"
},
{
\"UID\": \"91c10203-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"79da3767-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Прочие\"
},
{
\"UID\": \"79da3769-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"79da3768-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Гигиена полости рта\"
},
{
\"UID\": \"1191c793-dfa7-11e8-a22f-00505601048d\",
\"Родитель\": \"79da3768-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Гигиена прочая\"
},
{
\"UID\": \"7fd41229-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"79da3768-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Женская гигиена\"
},
{
\"UID\": \"7fd411f5-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"79da3769-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Зубные нити\"
},
{
\"UID\": \"79da376a-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"79da3769-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Зубные пасты\"
},
{
\"UID\": \"79da376c-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"79da3769-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Зубные щетки\"
},
{
\"UID\": \"f173ab6e-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"79da3769-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Ополаскиватели\"
},
{
\"UID\": \"223455ab-fde8-11e8-a231-00505601048d\",
\"Родитель\": \"79da3769-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Отбеливающие системы\"
},
{
\"UID\": \"e57cc196-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"79da3769-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Прочие средства для гигиены полости рта\"
},
{
\"UID\": \"7632204b-aaac-11e8-a216-00505601048d\",
\"Родитель\": \"7fd4121a-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Дезодоранты кремовые\"
},
{
\"UID\": \"7fd4128c-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"7fd4121a-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Дезодоранты спреи\"
},
{
\"UID\": \"8bc5d4bb-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"7fd4121a-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Дезодоранты стики\"
},
{
\"UID\": \"7fd4121b-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"7fd4121a-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Дезодоранты шариковые\"
},
{
\"UID\": \"8247d9f5-fdef-11e8-a231-00505601048d\",
\"Родитель\": \"7fd4121a-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Прочие дезодоранты\"
},
{
\"UID\": \"7fd4121c-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"7fd4121b-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Дезодоранты шариковые женские\"
},
{
\"UID\": \"7fd4122a-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"7fd41229-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Прокладки, тампоны\"
},
{
\"UID\": \"03686039-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"7fd4123b-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Ватная продукция\"
},
{
\"UID\": \"97bcfe7e-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"7fd4123b-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Интимная гигиена\"
},
{
\"UID\": \"7fd4123c-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"7fd4123b-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Салфетки\"
},
{
\"UID\": \"f173abf8-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"7fd4123c-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Бумажные салфетки\"
},
{
\"UID\": \"8cf11ab9-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"7fd4123c-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Влажные салфетки антибактериальные\"
},
{
\"UID\": \"7fd4123d-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"7fd4123c-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Влажные салфетки универсальные\"
},
{
\"UID\": \"7fd4128d-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"7fd4128c-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Дезодоранты спреи женские\"
},
{
\"UID\": \"85ccc308-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"7fd41290-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Специальные средства для волос\"
},
{
\"UID\": \"7fd41291-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"7fd41290-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства для мытья волос\"
},
{
\"UID\": \"7fd41296-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"7fd41291-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Бальзамы и кондиционеры\"
},
{
\"UID\": \"7fd41292-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"7fd41291-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Шампуни\"
},
{
\"UID\": \"cd8fac4d-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"85ccc308-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Кремы для волос\"
},
{
\"UID\": \"85ccc34a-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"85ccc308-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Маски для волос\"
},
{
\"UID\": \"97bcfe8e-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"85ccc308-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Масло для волос\"
},
{
\"UID\": \"85ccc309-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"85ccc308-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Прочие средства для волос\"
},
{
\"UID\": \"85ccc352-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"85ccc308-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Спреи для волос\"
},
{
\"UID\": \"9db5c613-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"85ccc308-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Сыворотки для волос\"
},
{
\"UID\": \"85ccc30c-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"85ccc30b-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства для окрашивания\"
},
{
\"UID\": \"5407f80f-df9d-11e8-a22f-00505601048d\",
\"Родитель\": \"85ccc30c-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Безаммиачные краски\"
},
{
\"UID\": \"c791f539-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"85ccc30c-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Краски для бровей и ресниц\"
},
{
\"UID\": \"c791f5a4-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"85ccc30c-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Окислители\"
},
{
\"UID\": \"85ccc374-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"85ccc30c-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Осветлители для волос\"
},
{
\"UID\": \"e57cc1c7-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"85ccc30c-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Оттеночные средства для волос\"
},
{
\"UID\": \"e57cc15c-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"85ccc30c-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Прочие средства для окрашивания\"
},
{
\"UID\": \"85ccc30d-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"85ccc30c-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Стойкие краски\"
},
{
\"UID\": \"c791f576-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"85ccc30c-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Тонеры\"
},
{
\"UID\": \"85ccc377-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"85ccc376-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства для стирки\"
},
{
\"UID\": \"85ccc38c-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"85ccc376-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Чистящие и дезинфицирующие средства\"
},
{
\"UID\": \"f2761329-dfa5-11e8-a22f-00505601048d\",
\"Родитель\": \"85ccc377-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства для стирки одежды\"
},
{
\"UID\": \"ac2bbdca-dfa6-11e8-a22f-00505601048d\",
\"Родитель\": \"85ccc38c-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Дезинфицирующие и чистящие средства\"
},
{
\"UID\": \"8bc5d4bc-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"8bc5d4bb-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Дезодоранты стики женские\"
},
{
\"UID\": \"83b2474c-fdde-11e8-a231-00505601048d\",
\"Родитель\": \"8bc5d4c0-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Дезодоранты кремовые (м)\"
},
{
\"UID\": \"c1974c36-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"8bc5d4c2-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Подарочные наборы\"
},
{
\"UID\": \"fd6dbad6-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"8bc5d4c2-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Подарочные предложения Космо\"
},
{
\"UID\": \"8bc5d4c3-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"8bc5d4c2-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Прочее\"
},
{
\"UID\": \"86f414f7-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"8bc5d4c3-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Открытки\"
},
{
\"UID\": \"8bc5d4c4-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"8bc5d4c3-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Подарочные пакеты\"
},
{
\"UID\": \"36d03edb-dfa5-11e8-a22f-00505601048d\",
\"Родитель\": \"8bc5d4c4-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Пакеты подарочные\"
},
{
\"UID\": \"8bc5d4de-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"8bc5d4dd-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства для мытья бороды\"
},
{
\"UID\": \"8bc5d516-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"8bc5d4dd-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства для роста бороды\"
},
{
\"UID\": \"8bc5d4e3-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"8bc5d4dd-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства для укладки бороды\"
},
{
\"UID\": \"8bc5d502-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"8bc5d4fc-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Подарочные наборы по уходу за лицом (муж.)\"
},
{
\"UID\": \"8bc5d4fd-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"8bc5d4fc-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства по уходу за лицом (м)\"
},
{
\"UID\": \"5cae357a-bd7b-11e8-a21c-00505601048d\",
\"Родитель\": \"8bc5d4fd-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства по уходу за лицом мужские\"
},
{
\"UID\": \"8bc5d500-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"8bc5d4ff-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Подарочные наборы по уходу за волосами (муж.)\"
},
{
\"UID\": \"8bc5d526-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"8bc5d4ff-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства по уходу за волосами (м)\"
},
{
\"UID\": \"f29524bc-dfa3-11e8-a22f-00505601048d\",
\"Родитель\": \"8bc5d500-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Подарочные наборы по уходу за волосами мужские\"
},
{
\"UID\": \"74b534e4-dfa4-11e8-a22f-00505601048d\",
\"Родитель\": \"8bc5d502-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Подарочные наборы по уходу за лицом мужские\"
},
{
\"UID\": \"8baac489-dfa3-11e8-a22f-00505601048d\",
\"Родитель\": \"8bc5d526-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства по уходу за волосами мужские\"
},
{
\"UID\": \"17ef8684-decb-11e8-a22e-00505601048d\",
\"Родитель\": \"91c10203-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Вазы, предметы интерьера, посуда\"
},
{
\"UID\": \"9db5c63d-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"91c10203-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Пакеты\"
},
{
\"UID\": \"92e95cd1-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"91c10203-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Прочие\"
},
{
\"UID\": \"97bcfe6a-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe5a-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Маски\"
},
{
\"UID\": \"97bcfe5b-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe5a-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства по уходу за лицом\"
},
{
\"UID\": \"fd6dbadf-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe5a-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Уход за проблемной кожей\"
},
{
\"UID\": \"97bcfe62-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe5b-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Основной уход\"
},
{
\"UID\": \"97bcfe5f-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe5b-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Специальные средства, лечебная косметика для лица\"
},
{
\"UID\": \"97bcfe5c-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe5b-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства для очищения\"
},
{
\"UID\": \"4b8d9da7-df9f-11e8-a22f-00505601048d\",
\"Родитель\": \"97bcfe5c-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Гель для умывания\"
},
{
\"UID\": \"d38a556b-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe5c-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Масло для умывания\"
},
{
\"UID\": \"d98a02aa-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe5c-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Мицеллярная вода\"
},
{
\"UID\": \"d98a0265-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe5c-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Молочко для умывания\"
},
{
\"UID\": \"a97dbd05-fddb-11e8-a231-00505601048d\",
\"Родитель\": \"97bcfe5c-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Мыло для лица\"
},
{
\"UID\": \"97bcfe6e-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe5c-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Пенка для умывания\"
},
{
\"UID\": \"97bcfe72-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe5c-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Пилинги, скрабы\"
},
{
\"UID\": \"97bcfe5d-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe5c-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства для снятия макияжа\"
},
{
\"UID\": \"97bcfe74-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe5c-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Тоник для очищения\"
},
{
\"UID\": \"97bcfe70-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe5f-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Прочие специальные средства для лица\"
},
{
\"UID\": \"4b2e7078-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe5f-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства для бровей и ресниц\"
},
{
\"UID\": \"97bcfe60-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe5f-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства для кожи вокруг глаз\"
},
{
\"UID\": \"571ef42f-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe62-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Гель для лица\"
},
{
\"UID\": \"97bcfe63-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe62-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Крем для лица дневной\"
},
{
\"UID\": \"97bcfe65-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe62-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Крем для лица ночной\"
},
{
\"UID\": \"fd6dbaeb-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe62-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Масло для лица\"
},
{
\"UID\": \"9db5c5f2-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe62-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Прочие средства для основного ухода\"
},
{
\"UID\": \"9db5c60d-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe62-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Сыворотка для лица\"
},
{
\"UID\": \"d98a02a6-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe62-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Термальная вода\"
},
{
\"UID\": \"fd6dbaf7-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe62-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Флюид для лица\"
},
{
\"UID\": \"9db5c60b-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe62-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Эмульсия для лица\"
},
{
\"UID\": \"2740b35b-59c3-11e9-a245-00505601048d\",
\"Родитель\": \"97bcfe6a-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Маски\"
},
{
\"UID\": \"97bcfe77-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe76-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Антицеллюлитные средства\"
},
{
\"UID\": \"97bcfe79-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe76-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Кремы массажные для тела\"
},
{
\"UID\": \"f8a594c8-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe76-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Маска для тела\"
},
{
\"UID\": \"c791f52c-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe76-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Прочие моделирующие средства\"
},
{
\"UID\": \"c791f52f-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe76-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства для зоны декольте\"
},
{
\"UID\": \"8cf11b05-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe76-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Сыворотка для тела\"
},
{
\"UID\": \"97bcfe7f-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe7e-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Гели, мыло для интимной гигиены\"
},
{
\"UID\": \"fd6dbae9-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe7e-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Прочие средства для интимной гигиены\"
},
{
\"UID\": \"f173ac01-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe7e-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Салфетки для интимной гигиены\"
},
{
\"UID\": \"97bcfe87-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe86-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Уход за руками\"
},
{
\"UID\": \"8cf11aaa-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe87-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Антибактериальные гели для рук\"
},
{
\"UID\": \"df8377a9-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe87-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Бальзамы для рук\"
},
{
\"UID\": \"97bcfe88-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe87-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Кремы для рук\"
},
{
\"UID\": \"df8377b7-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe87-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Маска для рук\"
},
{
\"UID\": \"f770b354-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe87-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Перчатки для рук и ногтей\"
},
{
\"UID\": \"525a41e2-aaac-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfe87-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Прочие средства по уходу за руками\"
},
{
\"UID\": \"df8377ab-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfebb-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Бальзам для тела\"
},
{
\"UID\": \"97bcfebc-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfebb-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Кремы для тела\"
},
{
\"UID\": \"df837783-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfebb-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Лосьон для тела\"
},
{
\"UID\": \"df8377d6-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfebb-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Молочко для тела\"
},
{
\"UID\": \"d98a0281-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"97bcfebb-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Прочие средства для увлажнения тела\"
},
{
\"UID\": \"9db5c639-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"9db5c638-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Гели, кремы после бритья женские\"
},
{
\"UID\": \"d4b67430-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"9db5c638-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Лосьоны после бритья женские\"
},
{
\"UID\": \"1c17c8f4-fdf0-11e8-a231-00505601048d\",
\"Родитель\": \"9db5c638-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Прочие средства после бритья\"
},
{
\"UID\": \"8738d288-dfa8-11e8-a22f-00505601048d\",
\"Родитель\": \"9db5c63d-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Прочие пакеты\"
},
{
\"UID\": \"80c395a1-dfa8-11e8-a22f-00505601048d\",
\"Родитель\": \"9db5c63d-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Упаковочные пакеты\"
},
{
\"UID\": \"afa54c7c-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"9db5c640-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Декоративная косметика для бровей\"
},
{
\"UID\": \"a3ad3eca-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"9db5c640-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Декоративная косметика для глаз\"
},
{
\"UID\": \"9db5c641-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"9db5c640-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Декоративная косметика для губ\"
},
{
\"UID\": \"a3ad3e81-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"9db5c640-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Декоративная косметика для лица\"
},
{
\"UID\": \"9db5c642-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"9db5c641-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Бальзамы для губ\"
},
{
\"UID\": \"9db5c646-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"9db5c641-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Блески для губ\"
},
{
\"UID\": \"9db5c68c-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"9db5c641-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Карандаши для губ\"
},
{
\"UID\": \"9db5c662-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"9db5c641-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Помада\"
},
{
\"UID\": \"a3ad3f20-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"9db5c641-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Прочая косметика для губ\"
},
{
\"UID\": \"108c92ba-aaac-11e8-a216-00505601048d\",
\"Родитель\": \"9db5c641-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Тинты\"
},
{
\"UID\": \"afa54cf9-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"a3ad3e81-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"База под макияж\"
},
{
\"UID\": \"a3ad3e82-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"a3ad3e81-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Консилеры и корректоры\"
},
{
\"UID\": \"b59f41b4-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"a3ad3e81-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Контурирование\"
},
{
\"UID\": \"5f5c91b1-e80d-11e8-a230-00505601048d\",
\"Родитель\": \"a3ad3e81-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Матирующие салфетки\"
},
{
\"UID\": \"108c92b7-aaac-11e8-a216-00505601048d\",
\"Родитель\": \"a3ad3e81-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Прочая косметика для лица\"
},
{
\"UID\": \"a3ad3ecf-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"a3ad3e81-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Пудра\"
},
{
\"UID\": \"a3ad3eda-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"a3ad3e81-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Румяна\"
},
{
\"UID\": \"a9a7ef57-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"a3ad3e81-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Тональные средства и праймеры\"
},
{
\"UID\": \"a9a7ef65-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"a3ad3e81-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Хайлайтеры\"
},
{
\"UID\": \"a3ad3f0f-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"a3ad3e86-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Базовые покрытия\"
},
{
\"UID\": \"a3ad3e87-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"a3ad3e86-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Верхние покрытия\"
},
{
\"UID\": \"b59f41e1-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"a3ad3eca-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"База под тени\"
},
{
\"UID\": \"afa54c88-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"a3ad3eca-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Карандаши для век\"
},
{
\"UID\": \"a3ad3ecb-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"a3ad3eca-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Подводки\"
},
{
\"UID\": \"a9a7ef7c-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"a3ad3eca-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Прочая косметика для глаз\"
},
{
\"UID\": \"a3ad3ef3-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"a3ad3eca-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Тени\"
},
{
\"UID\": \"a9a7ef5c-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"a3ad3eca-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Тушь\"
},
{
\"UID\": \"afa54c7d-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"afa54c7c-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Воски, гели для бровей\"
},
{
\"UID\": \"afa54c81-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"afa54c7c-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Карандаши для бровей\"
},
{
\"UID\": \"6907b996-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"afa54c7c-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Наборы для бровей\"
},
{
\"UID\": \"afa54c9c-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"afa54c7c-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Прочая косметика для бровей\"
},
{
\"UID\": \"bb97bd42-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"afa54c7c-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Тени для бровей\"
},
{
\"UID\": \"512914dd-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"afa54c7c-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Тушь для бровей\"
},
{
\"UID\": \"bb97bd45-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"bb97bd44-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Парфюмерия мужская\"
},
{
\"UID\": \"58529a00-aaac-11e8-a216-00505601048d\",
\"Родитель\": \"bb97bd44-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Подарочные наборы парфюмерии (муж)\"
},
{
\"UID\": \"fccf842c-fddf-11e8-a231-00505601048d\",
\"Родитель\": \"bb97bd45-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Духи мужские\"
},
{
\"UID\": \"d0b0bbe9-f311-11e8-a230-00505601048d\",
\"Родитель\": \"bb97bd45-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Одеколоны мужские\"
},
{
\"UID\": \"50fad971-fde0-11e8-a231-00505601048d\",
\"Родитель\": \"bb97bd45-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Освежающие воды мужские\"
},
{
\"UID\": \"bb97bd7d-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"bb97bd45-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Парфюмерная вода мужская\"
},
{
\"UID\": \"66a71f8e-fde0-11e8-a231-00505601048d\",
\"Родитель\": \"bb97bd45-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Прочие парфюмерные средства мужские\"
},
{
\"UID\": \"23be2ae1-fde0-11e8-a231-00505601048d\",
\"Родитель\": \"bb97bd45-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Сухие духи мужские\"
},
{
\"UID\": \"bb97bd46-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"bb97bd45-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Туалетная вода мужская\"
},
{
\"UID\": \"bb97bd4c-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"bb97bd4b-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Парфюмерия\"
},
{
\"UID\": \"bb97bd4d-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"bb97bd4c-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Парфюмерные средства женские\"
},
{
\"UID\": \"df83781d-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"bb97bd4d-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Духи женские\"
},
{
\"UID\": \"e91b1e8f-fde4-11e8-a231-00505601048d\",
\"Родитель\": \"bb97bd4d-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Одеколоны женские\"
},
{
\"UID\": \"ffe7c408-fde4-11e8-a231-00505601048d\",
\"Родитель\": \"bb97bd4d-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Освежающие воды женские\"
},
{
\"UID\": \"bb97bd4e-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"bb97bd4d-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Парфюмерная вода женская\"
},
{
\"UID\": \"0fef08f2-fde5-11e8-a231-00505601048d\",
\"Родитель\": \"bb97bd4d-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Прочие парфюмерные средства женские\"
},
{
\"UID\": \"f8745df0-fde4-11e8-a231-00505601048d\",
\"Родитель\": \"bb97bd4d-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Сухие духи женские\"
},
{
\"UID\": \"bb97bd53-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"bb97bd4d-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Туалетная вода женская\"
},
{
\"UID\": \"585299fc-aaac-11e8-a216-00505601048d\",
\"Родитель\": \"c1974c36-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Подарочные наборы парфюмерии\"
},
{
\"UID\": \"c1974c37-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"c1974c36-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Подарочные наборы по уходу\"
},
{
\"UID\": \"c1974c3c-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"c1974c37-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Подарочные наборы по уходу за волосами\"
},
{
\"UID\": \"ceb97a68-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"c1974c37-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Подарочные наборы по уходу за лицом\"
},
{
\"UID\": \"96b6d55a-1e43-11e9-a23c-00505601048d\",
\"Родитель\": \"c1974c37-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Подарочные наборы по уходу за руками\"
},
{
\"UID\": \"c1974c38-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"c1974c37-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Подарочные наборы по уходу за телом\"
},
{
\"UID\": \"630f77a2-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"c1974c37-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Прочие подарочные наборы по уходу\"
},
{
\"UID\": \"c1974ca4-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"c1974ca3-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Аксессуары для бани\"
},
{
\"UID\": \"259c963a-fdee-11e8-a231-00505601048d\",
\"Родитель\": \"c1974ca3-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Настои для бани\"
},
{
\"UID\": \"2e78351e-fdee-11e8-a231-00505601048d\",
\"Родитель\": \"c1974ca3-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Прочие средства для бани\"
},
{
\"UID\": \"1684d442-aaac-11e8-a216-00505601048d\",
\"Родитель\": \"d98a02bb-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Блестки для ногтей\"
},
{
\"UID\": \"049b927d-aaac-11e8-a216-00505601048d\",
\"Родитель\": \"d98a02bb-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Карандаш для французского маникюра\"
},
{
\"UID\": \"049b9275-aaac-11e8-a216-00505601048d\",
\"Родитель\": \"d98a02bb-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Наборы для французского маникюра\"
},
{
\"UID\": \"049b9273-aaac-11e8-a216-00505601048d\",
\"Родитель\": \"d98a02bb-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Накладные ногти\"
},
{
\"UID\": \"d98a02bc-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"d98a02bb-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Наклейки, стразы для ногтей\"
},
{
\"UID\": \"d98a02d1-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"d98a02bb-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Прочие средства для дизайна ногтей\"
},
{
\"UID\": \"d98a02d8-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"d98a02d3-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Активация загара\"
},
{
\"UID\": \"8cf11afd-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"d98a02d3-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Бронзанты\"
},
{
\"UID\": \"d98a02d4-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"d98a02d3-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства для загара\"
},
{
\"UID\": \"f173abb7-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"d98a02d3-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Средства до и после загара\"
},
{
\"UID\": \"d98a02d5-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"d98a02d4-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Крем для загара для лица\"
},
{
\"UID\": \"f173abb2-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"d98a02d4-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Крем для загара для тела\"
},
{
\"UID\": \"571ef42c-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"d98a02d4-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Масло для загара\"
},
{
\"UID\": \"f2aaf0e6-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"d98a02d4-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Прочие средства для загара\"
},
{
\"UID\": \"5129158b-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"d98a02d4-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Спрей для загара\"
},
{
\"UID\": \"f2aaf0d5-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"d98a02d4-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Эмульсия для загара\"
},
{
\"UID\": \"d98a02d9-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"d98a02d8-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Крем для загара в солярии\"
},
{
\"UID\": \"8cf11b00-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"d98a02d8-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Прочие средства для активации загара\"
},
{
\"UID\": \"f173abbd-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"d98a02e7-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Жидкость для снятия лака\"
},
{
\"UID\": \"571ef444-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"d98a02e7-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Корректор для маникюра\"
},
{
\"UID\": \"86f414e3-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"d98a02e7-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Разбавители для лака\"
},
{
\"UID\": \"d98a02e8-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"d98a02e7-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Салфетки для снятия лака\"
},
{
\"UID\": \"f2aaf0dc-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"f173abb7-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Крем до и после загара\"
},
{
\"UID\": \"f173abb8-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"f173abb7-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Лосьон до и после загара\"
},
{
\"UID\": \"51291589-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"f173abb7-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Прочие средства до и после загара\"
},
{
\"UID\": \"f2aaf0b7-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"f173abb7-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Эмульсия до и после загара\"
},
{
\"UID\": \"f770b336-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"f770b335-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Чулочно носочные изделия (муж)\"
},
{
\"UID\": \"d349c9a3-fddf-11e8-a231-00505601048d\",
\"Родитель\": \"f770b336-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Чулочно-носочные изделия (м)\"
},
{
\"UID\": \"fd6dbad7-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"fd6dbad6-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Космо боксы\"
},
{
\"UID\": \"6a42ada2-aaac-11e8-a216-00505601048d\",
\"Родитель\": \"fd6dbad6-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Подарочные сертификаты\"
},
{
\"UID\": \"99ebbbc9-fde5-11e8-a231-00505601048d\",
\"Родитель\": \"fd6dbad7-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Космо-боксы к 8 марта\"
},
{
\"UID\": \"80f3a2c9-fde5-11e8-a231-00505601048d\",
\"Родитель\": \"fd6dbad7-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Космо-боксы к Новому году\"
},
{
\"UID\": \"fd6dbad8-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"fd6dbad7-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Сезонные Космо-боксы\"
},
{
\"UID\": \"fd6dbae0-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"fd6dbadf-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Уход за проблемной кожей\"
},
{
\"UID\": \"86f414fe-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"fd6dbae0-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Гель для проблемной кожи\"
},
{
\"UID\": \"d13d718e-fddb-11e8-a231-00505601048d\",
\"Родитель\": \"fd6dbae0-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Мыло против акне\"
},
{
\"UID\": \"6907b9d9-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"fd6dbae0-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Пластыри, полоски для проблемных зон\"
},
{
\"UID\": \"fd6dbae1-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"fd6dbae0-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Прочие средства по уходу за проблемной кожей\"
},
{
\"UID\": \"dab64e65-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"fd6dbae0-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Скрабы, пилинги для проблемной кожи\"
},
{
\"UID\": \"8cf11a98-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"fd6dbae0-aaaa-11e8-a216-00505601048d\",
\"Наименование\": \"Тоник для проблемной кожи\"
},
{
\"UID\": \"0368603a-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"03686039-aaab-11e8-a216-00505601048d\",
\"Наименование\": \"Ватные диски\"
},
{
\"UID\": \"0368603e-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"03686039-aaab-11e8-a216-00505601048d\",
\"Наименование\": \"Ватные палочки\"
},
{
\"UID\": \"c2c3746f-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"03686039-aaab-11e8-a216-00505601048d\",
\"Наименование\": \"Прочие средства ватной продукции\"
},
{
\"UID\": \"2154c1ae-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"03686057-aaab-11e8-a216-00505601048d\",
\"Наименование\": \"Прочая одежда\"
},
{
\"UID\": \"03686058-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"03686057-aaab-11e8-a216-00505601048d\",
\"Наименование\": \"Чулочно носочные изделия\"
},
{
\"UID\": \"03686059-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"03686058-aaab-11e8-a216-00505601048d\",
\"Наименование\": \"Носки\"
},
{
\"UID\": \"03686066-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"03686058-aaab-11e8-a216-00505601048d\",
\"Наименование\": \"Чулки и колготы\"
},
{
\"UID\": \"561b659f-dfa7-11e8-a22f-00505601048d\",
\"Родитель\": \"2154c1ae-aaab-11e8-a216-00505601048d\",
\"Наименование\": \"Одежда прочая\"
},
{
\"UID\": \"571ef475-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"571ef474-aaab-11e8-a216-00505601048d\",
\"Наименование\": \"Воск для депиляции\"
},
{
\"UID\": \"571ef47a-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"571ef474-aaab-11e8-a216-00505601048d\",
\"Наименование\": \"Кремы для депиляции\"
},
{
\"UID\": \"d5ad40b1-d281-11e8-a227-00505601048d\",
\"Родитель\": \"571ef474-aaab-11e8-a216-00505601048d\",
\"Наименование\": \"Паста для депиляции\"
},
{
\"UID\": \"571ef477-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"571ef474-aaab-11e8-a216-00505601048d\",
\"Наименование\": \"Полоски для депиляции\"
},
{
\"UID\": \"630f7834-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"571ef474-aaab-11e8-a216-00505601048d\",
\"Наименование\": \"Прочие средства для депиляции\"
},
{
\"UID\": \"9d5e70a1-dfa5-11e8-a22f-00505601048d\",
\"Родитель\": \"86f414f7-aaab-11e8-a216-00505601048d\",
\"Наименование\": \"Открытки.\"
},
{
\"UID\": \"d98a027b-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"8cf11ab1-aaab-11e8-a216-00505601048d\",
\"Наименование\": \"Масло для тела\"
},
{
\"UID\": \"8cf11ab2-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"8cf11ab1-aaab-11e8-a216-00505601048d\",
\"Наименование\": \"Масло косметическое\"
},
{
\"UID\": \"317661be-1e44-11e9-a23c-00505601048d\",
\"Родитель\": \"8cf11ab1-aaab-11e8-a216-00505601048d\",
\"Наименование\": \"Прочие масла\"
},
{
\"UID\": \"64487915-aaac-11e8-a216-00505601048d\",
\"Родитель\": \"8cf11afd-aaab-11e8-a216-00505601048d\",
\"Наименование\": \"Аксессуары для автозагара\"
},
{
\"UID\": \"8cf11afe-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"8cf11afd-aaab-11e8-a216-00505601048d\",
\"Наименование\": \"Лосьоны - автозагары\"
},
{
\"UID\": \"8e1e5eed-aaac-11e8-a216-00505601048d\",
\"Родитель\": \"8cf11afd-aaab-11e8-a216-00505601048d\",
\"Наименование\": \"Прочие бронзанты\"
},
{
\"UID\": \"883d4bd4-fdf0-11e8-a231-00505601048d\",
\"Родитель\": \"8cf11afd-aaab-11e8-a216-00505601048d\",
\"Наименование\": \"Салфетки-автозагары\"
},
{
\"UID\": \"dab64e94-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"8cf11afd-aaab-11e8-a216-00505601048d\",
\"Наименование\": \"Спреи - автозагары\"
},
{
\"UID\": \"fa42920b-dfaa-11e8-a22f-00505601048d\",
\"Родитель\": \"92e95cd1-aaab-11e8-a216-00505601048d\",
\"Наименование\": \"Дисконтные карточки\"
},
{
\"UID\": \"9cad3661-dfaa-11e8-a22f-00505601048d\",
\"Родитель\": \"92e95cd1-aaab-11e8-a216-00505601048d\",
\"Наименование\": \"Прочие хоз.товары\"
},
{
\"UID\": \"aad8b120-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"aad8b11f-aaab-11e8-a216-00505601048d\",
\"Наименование\": \"Кремы после депиляции\"
},
{
\"UID\": \"f2aaf086-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"aad8b11f-aaab-11e8-a216-00505601048d\",
\"Наименование\": \"Прочие средства после депиляции\"
},
{
\"UID\": \"6a4cfd32-e00f-11e8-a22f-00505601048d\",
\"Родитель\": \"c2c37464-aaab-11e8-a216-00505601048d\",
\"Наименование\": \"Туалетная бумага.\"
},
{
\"UID\": \"d4b6742e-aaab-11e8-a216-00505601048d\",
\"Родитель\": \"d4b6742d-aaab-11e8-a216-00505601048d\",
\"Наименование\": \"Гели, кремы для бритья женские\"
},
{
\"UID\": \"085ba63b-fdf0-11e8-a231-00505601048d\",
\"Родитель\": \"d4b6742d-aaab-11e8-a216-00505601048d\",
\"Наименование\": \"Пены для бритья женские\"
},
{
\"UID\": \"55f47517-bd7b-11e8-a21c-00505601048d\",
\"Родитель\": \"d4b6742d-aaab-11e8-a216-00505601048d\",
\"Наименование\": \"Прочие средства для бритья\"
},
{
\"UID\": \"585299fd-aaac-11e8-a216-00505601048d\",
\"Родитель\": \"585299fc-aaac-11e8-a216-00505601048d\",
\"Наименование\": \"Подарочные наборы парфюмерии женские\"
},
{
\"UID\": \"7ee7d0d7-fde0-11e8-a231-00505601048d\",
\"Родитель\": \"58529a00-aaac-11e8-a216-00505601048d\",
\"Наименование\": \"Подарочные наборы парфюмерии (м)\"
},
{
\"UID\": \"f66310c7-d83e-11e8-a22c-00505601048d\",
\"Родитель\": \"6a42ada2-aaac-11e8-a216-00505601048d\",
\"Наименование\": \"Подарочные сертификаты номинал 1 000 руб.\"
},
{
\"UID\": \"f9f74251-3fff-11e9-a240-00505601048d\",
\"Родитель\": \"6a42ada2-aaac-11e8-a216-00505601048d\",
\"Наименование\": \"Подарочные сертификаты номинал 10 руб.\"
},
{
\"UID\": \"6a42ada3-aaac-11e8-a216-00505601048d\",
\"Родитель\": \"6a42ada2-aaac-11e8-a216-00505601048d\",
\"Наименование\": \"Подарочные сертификаты номинал 100 руб.\"
},
{
\"UID\": \"6a42ada5-aaac-11e8-a216-00505601048d\",
\"Родитель\": \"6a42ada2-aaac-11e8-a216-00505601048d\",
\"Наименование\": \"Подарочные сертификаты номинал 15 руб.\"
},
{
\"UID\": \"6a42ada7-aaac-11e8-a216-00505601048d\",
\"Родитель\": \"6a42ada2-aaac-11e8-a216-00505601048d\",
\"Наименование\": \"Подарочные сертификаты номинал 150 руб.\"
},
{
\"UID\": \"6a42ada9-aaac-11e8-a216-00505601048d\",
\"Родитель\": \"6a42ada2-aaac-11e8-a216-00505601048d\",
\"Наименование\": \"Подарочные сертификаты номинал 20 руб.\"
},
{
\"UID\": \"6a42adab-aaac-11e8-a216-00505601048d\",
\"Родитель\": \"6a42ada2-aaac-11e8-a216-00505601048d\",
\"Наименование\": \"Подарочные сертификаты номинал 25 руб.\"
},
{
\"UID\": \"6a42adad-aaac-11e8-a216-00505601048d\",
\"Родитель\": \"6a42ada2-aaac-11e8-a216-00505601048d\",
\"Наименование\": \"Подарочные сертификаты номинал 35 руб.\"
},
{
\"UID\": \"f1da97d2-3fff-11e9-a240-00505601048d\",
\"Родитель\": \"6a42ada2-aaac-11e8-a216-00505601048d\",
\"Наименование\": \"Подарочные сертификаты номинал 5 руб.\"
},
{
\"UID\": \"6a42adaf-aaac-11e8-a216-00505601048d\",
\"Родитель\": \"6a42ada2-aaac-11e8-a216-00505601048d\",
\"Наименование\": \"Подарочные сертификаты номинал 50 руб.\"
},
{
\"UID\": \"7632204c-aaac-11e8-a216-00505601048d\",
\"Родитель\": \"7632204b-aaac-11e8-a216-00505601048d\",
\"Наименование\": \"Дезодоранты кремовые женские\"
},
{
\"UID\": \"3ad72144-d27e-11e8-a227-00505601048d\",
\"Родитель\": \"3ad72143-d27e-11e8-a227-00505601048d\",
\"Наименование\": \"Средства для моделирования волос (м)\"
},
{
\"UID\": \"3ad72145-d27e-11e8-a227-00505601048d\",
\"Родитель\": \"3ad72144-d27e-11e8-a227-00505601048d\",
\"Наименование\": \"Стайлинг (муж)\"
},
{
\"UID\": \"e1ed1101-fdde-11e8-a231-00505601048d\",
\"Родитель\": \"cfb3b748-d281-11e8-a227-00505601048d\",
\"Наименование\": \"Прочие дезодоранты (м)\"
},
{
\"UID\": \"d8f535ca-dfa8-11e8-a22f-00505601048d\",
\"Родитель\": \"17ef8684-decb-11e8-a22e-00505601048d\",
\"Наименование\": \"Вазы, предметы интерьера, посуда, проч.\"
},
{
\"UID\": \"20aca59c-dfa7-11e8-a22f-00505601048d\",
\"Родитель\": \"1191c793-dfa7-11e8-a22f-00505601048d\",
\"Наименование\": \"Гигиена прочие средства\"
},
{
\"UID\": \"49ce208f-dfa9-11e8-a22f-00505601048d\",
\"Родитель\": \"41d5e32e-dfa9-11e8-a22f-00505601048d\",
\"Наименование\": \"Бижутерия\"
},
{
\"UID\": \"802af166-e00f-11e8-a22f-00505601048d\",
\"Родитель\": \"6a4cfd32-e00f-11e8-a22f-00505601048d\",
\"Наименование\": \"Туалетная бумага..\"
},
{
\"UID\": \"a2b06bfa-495d-11e9-a243-00505601048d\",
\"Родитель\": \"df0288e0-4661-11e9-a243-00505601048d\",
\"Наименование\": \"Прочие аксессуары\"
},
{
\"UID\": \"78079f96-46e8-11e9-a243-00505601048d\",
\"Родитель\": \"27bb4c5a-4662-11e9-a243-00505601048d\",
\"Наименование\": \"Аксессуары, мочалки, губки\"
},
{
\"UID\": \"7cec1673-46ea-11e9-a243-00505601048d\",
\"Родитель\": \"78079f96-46e8-11e9-a243-00505601048d\",
\"Наименование\": \"Аксессуары, мочалки, губки\"
},
{
\"UID\": \"41d5e32e-dfa9-11e8-a22f-00505601048d\",
\"Родитель\": \"e9cd681c-46e8-11e9-a243-00505601048d\",
\"Наименование\": \"Бижутерия\"
},
{
\"UID\": \"df0288e0-4661-11e9-a243-00505601048d\",
\"Родитель\": \"e9cd681c-46e8-11e9-a243-00505601048d\",
\"Наименование\": \"Прочие аксессуары\"
},
{
\"UID\": \"9db5c601-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"2740b35b-59c3-11e9-a245-00505601048d\",
\"Наименование\": \"Маски для лица мини паки\"
},
{
\"UID\": \"9db5c618-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"2740b35b-59c3-11e9-a245-00505601048d\",
\"Наименование\": \"Маски для лица саше\"
},
{
\"UID\": \"97bcfe6c-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"2740b35b-59c3-11e9-a245-00505601048d\",
\"Наименование\": \"Маски для лица тубы, банки\"
},
{
\"UID\": \"f770b356-aaaa-11e8-a216-00505601048d\",
\"Родитель\": \"2740b35b-59c3-11e9-a245-00505601048d\",
\"Наименование\": \"Патчи для лица\"
},
{
\"UID\": \"55f47514-bd7b-11e8-a21c-00505601048d\",
\"Родитель\": \"2740b35b-59c3-11e9-a245-00505601048d\",
\"Наименование\": \"Прочие маски для лица\"
}
]";
$outArr = [
    [
        'ID' => 2,
        'PARENT_ID' => 1,
    ],
    [
        'ID' => 3,
        'PARENT_ID' => 1,
    ],
    [
        'ID' => 1,
        'PARENT_ID' => false,
    ],
    [
        'ID' => 4,
        'PARENT_ID' => 3,
    ],
    [
        'ID' => 5,
        'PARENT_ID' => 2,
    ],
    [
        'ID' => 6,
        'PARENT_ID' => false,
    ],
    [
        'ID' => 7,
        'PARENT_ID' => 4,
    ],
    [
        'ID' => 8,
        'PARENT_ID' => 7,
    ],
    [
        'ID' => 9,
        'PARENT_ID' => [6, 8],
    ],
];
$outArr = json_decode($JSON, true);
$buildTree = new Utils\BuildTree($outArr);
$result = $buildTree->createTree();

echo '<pre>' . print_r($buildTree->getTree(), true) . '</pre>';

